
var test_data = [
    [0, 'শুন্য'],
    [8, 'আট'],
    [49, 'ঊনপঞ্চাশ'],
    [400, 'চারশো'],
    [704, 'সাতশো চার'],
    [939, 'নয়শো ঊনচল্লিশ'],
    [3204, 'তিন হাজার দুইশো চার'],
    [20001, 'বিশ হাজার এক'],
    [20308, 'বিশ হাজার তিনশো আট'],
    [50000, 'পঞ্চাশ হাজার'],
    [200007, 'দুই লাখ সাত'],
    [700000, 'সাত লাখ'],
    [2000603, 'বিশ লাখ ছয়শো তিন'],
    [5000000, 'পঞ্চাশ লাখ'],
    [1923908, 'ঊনিশ লাখ তেইশ হাজার নয়শো আট'],
    [83641705, 'আট কোটি ছত্রিশ লাখ একচল্লিশ হাজার সাতশো পাঁচ'],
    [80000000, 'আট কোটি'],
    [80000002, 'আট কোটি দুই'],
    [500000000, 'পঞ্চাশ কোটি'],
    [501619500, 'পঞ্চাশ কোটি ষোল লাখ ঊনিশ হাজার পাঁচশো'],
    [900000000, 'নব্বই কোটি'],
    [987654321, 'আটানব্বই কোটি ছিয়াত্তর লাখ চুয়ান্ন হাজার তিনশো একুশ'],
    [990000000, 'নিরানব্বই কোটি'],
    [990000001, 'নিরানব্বই কোটি এক'],
    [999999999, 'নিরানব্বই কোটি নিরানব্বই লাখ নিরানব্বই হাজার নয়শো নিরানব্বই'],
    [9999999999, 'নয়শো নিরানব্বই কোটি নিরানব্বই লাখ নিরানব্বই হাজার নয়শো নিরানব্বই'],
    [99999999999, 'নয় হাজার নয়শো নিরানব্বই কোটি নিরানব্বই লাখ নিরানব্বই হাজার নয়শো নিরানব্বই'],
    [999999999999, 'নিরানব্বই হাজার নয়শো নিরানব্বই কোটি নিরানব্বই লাখ নিরানব্বই হাজার নয়শো নিরানব্বই']
];

QUnit.test("All tests for ES6 version", function (assert) {
    for (var i = 0; i < test_data.length; ++i) {
        assert.equal(NumToBangla.convert(test_data[i][0]), test_data[i][1],
            test_data[i][0] + ' => ' + test_data[i][1]);
    }
});